{
    "201":"",
    "203":"Air slug before sample not detected",
    "204":"Cartridge failure (plumbing or sampler) or hardware failure (Luer motor or encoder)",
    "220":"Motor, sensor, encoder disk, cabling, DCS board fuse or circuit failure",
    "119":"Motor, cabling, DCS board fuse or circuit failure",
    "221":"Sensor, encoder, cabling, DCS board fuse or circuit failure",
    "222":"Sample handling error or cartridge failure",
    "223":"Sample handling error or cartridge failure",
    "224":"Sample handling error or cartridge failure",
    "228":"Defective EEPROM on cartridge, EEPRO reader, DCS Board",
    "230":"General temperature error: refer to sub codes",
    "231":"Broken or shorted thermistor wire on module or cable, DCS failure",
    "232":"Broken or shorted thermistor wire on module or cable, DCS heating circuit failure, or TEC calibration failure",
    "233":"Broken or shorted thermistor wire on module or cable, DCS heating circuit failure, or TEC calibration failure",
    "234":"Broken or shorted thermistor wire on module or cable, DCS failure",
    "235":"Broken or shorted thermistor wire on module or cable, LED/NEON board",
    "245":"Broken or shorted thermistor wire on cable or not connected to fan controller cabling",
    "246":"Broken or shorted thermistor wire on cable or not connected to fan controller cabling",
    "236":"General power supply error: refer to sub codes",
    "237":"+5V voltage is out of range. Fuse blown on DCS board, voltage not adjusted to correct setting, or cable failure",
    "238":"+12V voltage is out of range. Fuse blown on DCS board, voltage not adjusted to correct setting, or cable failure",
    "239":"+24V voltage is out of range. Fuse blown on DCS board, voltage not adjusted to correct setting, or cable failure",
    "240":"Cartridge failure (plumbing, leak, or out of solution) or hardware failure (RV, pump, solenoids, electronics, etc)",
    "241":"Motor, sensor, encoder or DCS board fuse or circuit failure",
    "242":"Sensor, encoder, cabling, DCS failure",
    "243":"Sensor, encoder, cabling, DCS failure",
    "244":"Motor, DCS, or cabling failure",
    "247":"Power or communications cable not connected to fan controller board",
    "260":"Door solenoid, door springs, door skin binding, or door out of adjustment",
    "261":"Pumpcal. General error",
    "262":"Cartridge failure in EC Path (plumbing, leak or out of solution) or hardware failure (RV, pump, solenoids, electronics, etc)",
    "263":"Cartridge failure in EC Path (plumbing, leak or out of solution) or hardware failure (RV, pump, solenoids, electronics, etc)",
    "264":"Broken optical fibers, LED/NEON board failure, LED bulb failure",
    "286":"Broken optical fibers, LED/NEON board failure, LED bulb failure",
    "265":"Cartridge failure or electronics failure (analog or DCS board)",
    "266":"DCS board fuses, analog board DAC calibration failure, or cabling",
    "267":"Motor, sensor, cablnig, DCS board fuse or circuit failure",
    "268":"DCS board",
    "269":"Battery, analog board, DCS board. Battery should recharge when instrument rebooted. If error persists the replace the battery 1st, the PCS board, then heater block then analog board then power supply",
    "270":"Cartridge failure (leak)",
    "281":"Cabling, DCS board circuit failure, failed solenoid possibly due to solution on diverter valve solenoid body",
    "282":"Cabling, DCS board circuit failure, failed solenoid possibly due to solution on diverter valve solenoid body",
    "285":"Broken optical fiber (from optics head to Spec.), LED/NEON board failure, Neon bulb failure, cable",
    "287":"Miss/incomplete/corrupt COOx calibration files due to failed calibration or bad files",
    "288":"USB connection to SECO, USB update not installed, spectrometer failure",
    "289":"Cartridge failure ()2 sensor"
}